Show / Hide Table of Contents
Class ReinforcementGroup
Base class representing group reinforcement in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
BentUpBar
ReinfAroundOpening
ReinfBarByPolyline
ReinfBarByTwoPoints
ReinfBarInclined
ReinfBarOnEdge
ReinfBarOnMoreEdges
Inherited Members
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ReinforcementGroup : Reinforcement
Properties
Improve this Doc   View Source
Cover
Cover of reinforcement
Declaration
public double Cover { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
CoverFromSetting
Use cover from DetailModelSetting
Declaration
public bool CoverFromSetting { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Diameter
Diameter o reinforcement
Declaration
public double Diameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiameterOfMandrel
Diameter of mandrel - multiplier of bar diameter to obtain inner diameter of bent reinforcement bars
Declaration
public double DiameterOfMandrel { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EndsTypeBeg
End type of the beginning of reinforcement bar
Declaration
public LongReinfEndType EndsTypeBeg { get; set; }
Property Value
 Type |  Description
 LongReinfEndType
Improve this Doc   View Source
EndsTypeEnd
End type of the end of reinforcement bar
Declaration
public LongReinfEndType EndsTypeEnd { get; set; }
Property Value
 Type |  Description
 LongReinfEndType
Improve this Doc   View Source
NumOfBarsInLayer
Number of bars in layer
Declaration
public int NumOfBarsInLayer { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source